#อ่านภาพ
import cv2 # นำเข้าโมดูล cv2 มาใช้งาน โดยใช้ชื่อ cv2 แทน  

img= cv2.imread('Python OpenCV\image\cat.jpg') # อ่านภาพจากไฟล์ cat.jpg แล้วเก็บไว้ในตัวแปร img
print(img) # ผลของการอ่านภาพจะได้ Numpy Array ที่เป็นรูปแบบของอาร์เรย์สามมิติมาใช้งาน โดยจะมีค่าของแต่ละส่วนเป็นค่าสีของแต่ละพิกเซล
print(img.ndim) # จะดูว่าเป็นอาร์กี่มิติ (ndim = n dimension) จะได้ค่า 3 แสดงว่าเป็นอาร์เรย์สามมิติ คือ ความสูง ความกว้าง และ ค่าสีของแต่ละพิกเซล
print(type(img.ndim)) # จะดูว่าชนิดข้อมูลเป็นอะไร จะได้ค่า <class 'int'> เป็น interger แสดงว่าเป็นจำนวนเต็ม
print(img.shape) # จะดูว่ามีขนาดของอาร์เรย์เท่าไหร่ จะได้ค่า (height, width, channel) จะได้ค่า (480, 640, 3) แสดงว่ามีความสูง 480 พิกเซล ความกว้าง 640 พิกเซล และมี 3 ช่องสี
print(type(img.shape)) # จะดูว่าชนิดข้อมูลเป็นอะไร จะได้ค่า <class 'tuple'> เป็น tuple ที่มีค่าคงที่ไม่สามารถเปลี่ยนแปลงได้ และมีค่าที่เรียงต่อกัน 
print(img.size) # จะดูว่ามีขนาดของอาร์เรย์เท่าไหร่ จะได้ค่า 921600 แสดงว่ามีขนาด 921600 พิกเซล คือ 480 x 640 x 3 คือ ความสูง x ความกว้าง x จำนวนช่องสี
print(type(img.size)) # จะดูว่าชนิดข้อมูลเป็นอะไร จะได้ค่า <class 'int'> เป็น interger และจะเห็นว่ามีค่าเท่ากับ 480 x 640 x 3
print(img.dtype) # จะดูว่ามีชนิดของข้อมูลเป็นอะไร จะได้ค่า uint8 แสดงว่ามีค่าเป็นตัวเลขจำนวนเต็ม 8 บิต และมีค่าระหว่าง 0-255 โดยค่า 0 แสดงว่าสีดำ ค่า 255 แสดงว่าสีขาว
print(type(img.dtype)) # จะดูว่าชนิดข้อมูลเป็นอะไร จะได้ค่า <class 'str'> เป็น string แสดงว่าเป็นข้อความ
