# การเขียนภาพ
import cv2  # โหลด OpenCV มาใช้งาน โดยตั้งชื่อว่า cv2 

img=cv2.imread("Python OpenCV\image\cat.jpg",0) # อ่านภาพ cat.jpg มาเก็บในตัวแปร img 
imgresize = cv2.resize(img,(400,300)) # ปรับขนาดภาพให้กว้าง 400 สูง 300 พิกเซล 
cv2.imshow("My cat",imgresize) # แสดงภาพที่อ่านมา และปรับขนาด 
cv2.imwrite("output.jpg",imgresize) # การเขียนภาพ โดยการกำหนดชื่อไฟล์ใหม่ และ ภาพที่ต้องการเขียน 
#โดยจะเขียนทับไฟล์เดิม ถ้ามีชื่อซ้ำ หรือ สร้างไฟล์ใหม่ ถ้าไม่มีชื่อซ้ำ   

cv2.waitKey(0) # รอกดปุ่มใดปุ่มหนึ่ง 0 คือรอกดปุ่มใดปุ่มหนึ่ง ไม่จำกัดเวลา
cv2.destroyAllWindows() # ปิดหน้าต่างทั้งหมด  