# ปรับเปลี่ยนขนาดภาพ
# ใช้ฟังก์ชัน cv2.resize() ในการปรับขนาดภาพ
# ฟังก์ชัน cv2.resize() มี 2 พารามิเตอร์ คือ ภาพ และ ขนาดที่ต้องการ
# ขนาดที่ต้องการ กำหนดได้ 2 แบบ คือ กำหนดขนาดแบบเปอร์เซ็นต์ หรือ กำหนดขนาดแบบความกว้างและสูง
# ในที่นี้ จะใช้กำหนดขนาดแบบเปอร์เซ็นต์
# ในการกำหนดขนาดแบบเปอร์เซ็นต์ ให้กำหนดขนาดในรูปแบบของ tuple โดยกำหนดค่าในรูปแบบ (กว้าง,สูง)
# ในที่นี้ จะกำหนดให้ภาพมีขนาดเท่ากับ 50% ของขนาดเดิม
# ในการกำหนดขนาดแบบความกว้างและสูง ให้กำหนดขนาดในรูปแบบของ tuple โดยกำหนดค่าในรูปแบบ (ความกว้าง,สูง)
# ในที่นี้ จะกำหนดให้ภาพมีขนาดเท่ากับ ความกว้าง 200 และ สูง 300

import cv2  # โหลด OpenCV เข้ามาใช้งาน โดยตั้งชื่อว่า cv2 
img= cv2.imread('Python OpenCV\image\cat.jpg')  # อ่านภาพ cat.jpg
imgResize= cv2.resize(img,(200,300))  # ปรับขนาดภาพ ให้มีความกว้าง 200 และ สูง 300
imgResize2= cv2.resize(img,(0,0),None,0.5,0.5)  # ปรับขนาดภาพ ให้มีขนาดเท่ากับ 50% ของขนาดเดิม

# แสดงภาพ 
cv2.imshow('Output',img) # แสดงภาพ โดยใช้ชื่อ 'Output' แสดงผล และใช้ img แสดงผล 
cv2.imshow('Output Resize',imgResize) # แสดงภาพ โดยใช้ชื่อ 'Output Resize' แสดงผล และใช้ imgResize แสดงผล
cv2.imshow('Output Resize2',imgResize2) # แสดงภาพ โดยใช้ชื่อ 'Output Resize2' แสดงผล และใช้ imgResize2 แสดงผล
cv2.waitKey(0) # รอการกดปุ่มใดๆ จากคีย์บอร์ด
cv2.destroyAllWindows() # ปิดหน้าต่างทั้งหมด ที่เปิดขึ้นมา โดยใช้ cv2.imshow() แสดงผล ออกจากโปรแกรม 